---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceAlbedo
source: html/321a1046-0723-1989-8eb0-a00d02864d2e.htm
---
# Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceAlbedo Property

The property labeled "Color" from the "AdvancedOpaque" schema.

## Syntax (C#)
```csharp
public static string SurfaceAlbedo { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.